In [35]:
import pandas as pd
import numpy as np

SERIES IN PANDAS:

In [36]:
s = pd.Series([10,20,30,40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [37]:
print(s[0])

10

CUSTOM INDEX

In [38]:
s = pd.Series([10,20,30],index=["a","b","c"])
print(s)

a    10
b    20
c    30
dtype: int64

In [39]:
print(s["a"])
print(s[0])

10
10

C:\Users\Raissa Lovasoa\AppData\Local\Temp\ipykernel_17288\3750109007.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])

SERIES FROM DICTIONARY

In [40]:
data = {"Math":90,"Physics":85,"Chemistry":88}
marks = pd.Series(data)
print(data)

{'Math': 90, 'Physics': 85, 'Chemistry': 88}

In [41]:
print(marks)

Math         90
Physics      85
Chemistry    88
dtype: int64

DATA FRAME IN PANDAS

In [42]:
data = {
    "Name":["Aman","Krish","Karan"],
    "Age":[22,23,21],
    "Marks":[85,90,88]
}
print(data)
type(data)

{'Name': ['Aman', 'Krish', 'Karan'], 'Age': [22, 23, 21], 'Marks': [85, 90, 88]}

dict

In [43]:
#Pandas automatically adds a default index:This is called Range index(start from 0 by default)
marks = pd.DataFrame(data)
print(marks)

    Name  Age  Marks
0   Aman   22     85
1  Krish   23     90
2  Karan   21     88

In [44]:
#Add custom index
marks = pd.DataFrame(data,
                        index=["Student1","Student2","Student3"])
print(marks)

           Name  Age  Marks
Student1   Aman   22     85
Student2  Krish   23     90
Student3  Karan   21     88

In [45]:
marks.set_index("Name",inplace=True)#If we are setting inplace = true it means we are changing the original object 
print(marks)

       Age  Marks
Name
Aman    22     85
Krish   23     90
Karan   21     88

In [46]:
df = pd.DataFrame({
    "Name": ["Aman","saurav","Karan"],
    "Age":[22,23,21], 
    "Marks":[85,90,88]
})

In [47]:
df.head(2)

     Name  Age  Marks
0    Aman   22     85
1  saurav   23     90

In [48]:
df.tail(2)

     Name  Age  Marks
1  saurav   23     90
2   Karan   21     88

In [49]:
df.shape

(3, 3)

In [50]:
df.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Marks   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [52]:
df.describe()#Descriptive statistic of data

        Age      Marks
count   3.0   3.000000
mean   22.0  87.666667
std     1.0   2.516611
min    21.0  85.000000
25%    21.5  86.500000
50%    22.0  88.000000
75%    22.5  89.000000
max    23.0  90.000000

SELECTING THE DATA

In [53]:
df["Name"]

0      Aman
1    saurav
2     Karan
Name: Name, dtype: object

In [54]:
df[["Name","Marks"]]

     Name  Marks
0    Aman     85
1  saurav     90
2   Karan     88

FILTERING IN PANDAS

In [55]:
df[df["Marks"] > 85]

     Name  Age  Marks
1  saurav   23     90
2   Karan   21     88

In [56]:
#Multiple condition
df[(df["Age"] > 21) & (df["Marks"] > 85)]

     Name  Age  Marks
1  saurav   23     90

SORTING + VALUE COUNTS

In [57]:
df.sort_values("Marks")

     Name  Age  Marks
0    Aman   22     85
2   Karan   21     88
1  saurav   23     90

In [58]:
df.sort_values("Marks",ascending=False)

     Name  Age  Marks
1  saurav   23     90
2   Karan   21     88
0    Aman   22     85

In [59]:
df["Age"].value_counts()

Age
22    1
23    1
21    1
Name: count, dtype: int64

HANDLING MISSING DATA

In [60]:
df = pd.DataFrame({
    "Name":["Aman","saurav","Karan","Shubham",None,"Sameer"],
    "Age":[22,23,None,22,25,26],
    "Marks":[85,None,88,90,56,None]
})
df

      Name   Age  Marks
0     Aman  22.0   85.0
1   saurav  23.0    NaN
2    Karan   NaN   88.0
3  Shubham  22.0   90.0
4     None  25.0   56.0
5   Sameer  26.0    NaN

In [61]:
df.isnull()

    Name    Age  Marks
0  False  False  False
1  False  False   True
2  False   True  False
3  False  False  False
4   True  False  False
5  False  False   True

In [62]:
df.isnull().sum()

Name     1
Age      1
Marks    2
dtype: int64

In [63]:
df.dropna()

      Name   Age  Marks
0     Aman  22.0   85.0
3  Shubham  22.0   90.0

In [64]:
print(df)

      Name   Age  Marks
0     Aman  22.0   85.0
1   saurav  23.0    NaN
2    Karan   NaN   88.0
3  Shubham  22.0   90.0
4     None  25.0   56.0
5   Sameer  26.0    NaN

In [65]:
cleaned_data = df.dropna()

In [66]:
cleaned_data

      Name   Age  Marks
0     Aman  22.0   85.0
3  Shubham  22.0   90.0

# GroupBy in Pandas

In [68]:
data ={
    "Name" : ["Aman","Saurav","Karan","Shubham","Abhishek",None,"Sameer"],
    "Age" : [22,23,np.nan,22,25,24,26],
    "Marks":[85,np.nan,88,90,56,72,np.nan],
    "Subject" : ["Math","Physics","Math","Chemistry","Math","Physics","Chemistry"]
}
df = pd.DataFrame(data)
print(df)

       Name   Age  Marks    Subject
0      Aman  22.0   85.0       Math
1    Saurav  23.0    NaN    Physics
2     Karan   NaN   88.0       Math
3   Shubham  22.0   90.0  Chemistry
4  Abhishek  25.0   56.0       Math
5      None  24.0   72.0    Physics
6    Sameer  26.0    NaN  Chemistry

In [69]:
#Grupby basic/mean marks per subject
df.groupby('Subject')['Marks'].mean()

Subject
Chemistry    90.000000
Math         76.333333
Physics      72.000000
Name: Marks, dtype: float64

In [ ]:
df.groupby('Subject')['Name'].count()#Count student per subject /Ignore missing value

Subject
Chemistry    2
Math         3
Physics      1
Name: Name, dtype: int64

In [72]:
df.groupby('Subject').size()# will include the count value in the count

Subject
Chemistry    2
Math         3
Physics      2
dtype: int64

In [73]:
#Multiple aggregations
df.groupby('Subject')['Marks'].agg(['mean','max','min'])

                mean   max   min
Subject
Chemistry  90.000000  90.0  90.0
Math       76.333333  88.0  56.0
Physics    72.000000  72.0  72.0

In [ ]:
#Groupby multiple columns
df.groupby(['Subject','Age'])['Marks'].mean() # ->(in which column to apply)[what to apply]

Subject    Age
Chemistry  22.0    90.0
           26.0     NaN
Math       22.0    85.0
           25.0    56.0
Physics    23.0     NaN
           24.0    72.0
Name: Marks, dtype: float64